In [2]:
import pandas as pd

In [34]:
myfile=pd.read_csv(r"C:\Users\tejas\A-DATA ANALYTICS\PANDAS\test.csv")
myfile

     R1    R2    R3
0  10.0  20.0  30.0
1  11.0  21.0  31.0
2  12.0  22.0  32.0
3   NaN   NaN   NaN
4  16.0  13.0   NaN

In [26]:
myfile.dropna()

     R1    R2    R3
0  10.0  20.0  30.0
1  11.0  21.0  31.0
2  12.0  22.0  32.0

In [27]:
myfile.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [28]:
myfile.dropna(axis=0)

     R1    R2    R3
0  10.0  20.0  30.0
1  11.0  21.0  31.0
2  12.0  22.0  32.0

In [44]:
myfile.dropna(subset=['R3'])

     R1    R2    R3
0  10.0  20.0  30.0
1  11.0  21.0  31.0
2  12.0  22.0  32.0